-- 商品種類
INSERT INTO ProductType (pt_id, pt_name) VALUES 
(1, '盛り込み'),
(2, 'にぎり'),
(3, '鮨やの丼&おすすめ'),
(4, '地元に生まれた味'),
(5, 'お好みすし')


-- 商品マスタ
INSERT INTO Product (p_id,pt_id,price,p_name) VALUES 
(1,1,8650,'はな'),
(2,1,5680,'わだつみ'),
(3,1,4440,'あさなぎ'),
(4,1,3830,'ゆうなぎ'),
(5,5,100,'玉子'),
(6,5,100,'いなり'),
(7,5,100,'納豆軍艦'),
(8,5,100,'ツナサラダ'),
(9,5,100,'コーン'),
(10,5,100,'かにサラダ'),
(11,5,100,'オクラ軍艦'),
(12,5,150,'ゆでげそ'),
(13,5,150,'とびっこ'),
(14,5,150,'明太子サラダ'),
(15,5,150,'イカの塩辛'),
(16,5,150,'オクラ納豆'),
(17,5,150,'カンピョウ巻'),
(18,5,150,'なっとう巻'),
(19,5,150,'かっぱ巻'),
(20,5,150,'おしんこ巻'),
(21,5,150,'梅しそ巻'),
(22,5,180,'えび'),
(23,5,180,'赤いか'),
(24,5,180,'かにみそ軍艦')

-- Customer
INSERT INTO Customer (c_id, c_name,phonenumber,payment_flag) VALUES 
(1, '田中', "090-xxxx-xxxx", 0),
(2, '佐藤', "090-xxxx-xxxx", 0),
(3, '鈴木', "090-xxxx-xxxx", 1),
(4, '伊藤', "090-xxxx-xxxx", 1),
(5, '佐竹', "090-xxxx-xxxx", 1)

-- 注文履歴
INSERT INTO Order (od_id,c_id,isPaid,totalAmount, order_date) VALUES 
(1,1,true,12000, '2022/11/15 13:01:12'),
(2,1,true,14000, '2022/11/15 13:02:12'),
(3,1,true,15000, '2022/11/15 13:03:12'),
(4,1,true,16000, '2022/11/15 13:04:12'),
(5,1,false,17000, '2022/11/15 13:05:12')

-- 注文詳細
INSERT INTO OrderDetails (od_id, p_id,amount,sabi_flag, ricesize_flag,ricekind_flag) VALUES 
(1, 1, 1,0,0,0),
(1, 1, 1,0,0,0),
(1, 1, 1,0,0,0),
(2, 20, 1,0,0,0),
(2, 20, 1,0,0,0),
(3, 21, 1,0,0,0),
(4, 21, 1,0,0,0),
(4, 21, 1,0,0,0),
(5, 22, 1,0,0,0),
(5, 22, 1,0,0,0),
(5, 22, 1,0,0,0)
